.Push.GcmRegisterService.permission.C2D_MESSAGE
.gcm.permission.C2D_MESSAGE
.home.permission.WRITE_BADGES
.permission.A4S_SEND
.permission.C2D_MESSAGE
.permission.MAPS_RECEIVE
.permission.RECEIVE
.permission.RECEIVE_ADM_MESSAGE
.permission.SHOW_NOTIFICATION
ANDROID.permission.VIBRATE
Kal.FlightInfo.permission.C2D_MESSAGE
Manifest.permission.SET_WALLPAPER_HINTS
PACKAGE_NAME.permission.C2D_MESSAGE
a.b.c.d.permission.MAPS_RECEIVE
a.gunssounds.counter.weaponsounds.strike.shootgame.boltfree.permission.C2D_MESSAGE
a.league.live.permission.C2D_MESSAGE
a11.myteam.com.myteam11v1.permission.C2D_MESSAGE
abejanegra_136.permission.C2D_MESSAGE
abrajnet.com.en.permission.C2D_MESSAGE
ace.jun.simplepie.permission.C2D_MESSAGE
adams.beautiful.nails.permission.C2D_MESSAGE
adnroid.permission.CHANGE_WIFI_STATE
adu1.affairs.permission.C2D_MESSAGE
adult.dating.amaretto.permission.C2D_MESSAGE
advanced.speed.booster.permission.C2D_MESSAGE
ae.admedia.arabcasting.permission.C2D_MESSAGE
ae.ekar.permission.C2D_MESSAGE
ae.picasso.arabcasting2.permission.RECEIVE_ADM_MESSAGE
aen.whitebeard.me.aen.permission.C2D_MESSAGE
aero.sita.lab.resmobileweb.android.mh.permission.C2D_MESSAGE
aerolito.fractal.permission.C2D_MESSAGE
aerolito.tomorrow.permission.C2D_MESSAGE
af.divar.permission.C2D_MESSAGE
af.divar.permission.MAPS_RECEIVE
ag.sportradar.android.livescore.base.permission.C2D_MESSAGE
agency.sevenofnine.hrtmeteo.permission.C2D_MESSAGE
agile.ti.mobile.listapa.permission.C2D_MESSAGE
aicog2017.mobile.app.permission.C2D_MESSAGE
air.Android_Location.permission.C2D_MESSAGE
air.AngryRedButtonAndroid.permission.C2D_MESSAGE
air.BattleofZombies.permission.C2D_MESSAGE
air.Big2Bonanza.permission.C2D_MESSAGE
air.Cinepolis.permission.C2D_MESSAGE
air.DawnOfTheSniper2Android.permission.C2D_MESSAGE
air.DawnOfTheSniperAndroid.permission.C2D_MESSAGE
air.FingerVsAxesAndroid.permission.C2D_MESSAGE
air.FingerVsFarmersAndroid.permission.C2D_MESSAGE
air.HindiCalendar2014.permission.C2D_MESSAGE
air.air.com.gosugroup.battlefrontheroes.permission.C2D_MESSAGE
air.android.extremebabybirthg.permission.C2D_MESSAGE
air.at.porschebank.smartdriver.permission.C2D_MESSAGE
air.au.com.metro.DumbWaysToDie2.permission.C2D_MESSAGE
air.b247.gamebai.danhbai.doithuong.permission.C2D_MESSAGE
air.br.com.megajogos.mobile.permission.C2D_MESSAGE
air.br.com.netcartas.netburaco.permission.C2D_MESSAGE
air.brincandopalavras.permission.C2D_MESSAGE
air.bullstudios.cookinghappymania.permission.C2D_MESSAGE
air.byss.mobi.instafoodfree.permission.C2D_MESSAGE
air.byss.mobi.instaplacefree.permission.C2D_MESSAGE
air.com.A5thplanetgames.pets.permission.C2D_MESSAGE
air.com.HFG.A101EscapeGames.permission.C2D_MESSAGE
air.com.HFG.EscapeGames20.permission.C2D_MESSAGE
air.com.ace2three.mobile.permission.C2D_MESSAGE
air.com.and.games505.gemsofwar.permission.C2D_MESSAGE
air.com.avon.mobile.AvonMobile.permission.C2D_MESSAGE
air.com.avon.mobile.AvonMobile.permission.UA_DATA
air.com.avon.mobile.JustineMobile.permission.C2D_MESSAGE
air.com.avon.mobile.JustineMobile.permission.UA_DATA
air.com.bacay.danhbai.permission.C2D_MESSAGE
air.com.beachbumgammon.permission.C2D_MESSAGE
air.com.bigmage.JungleTreasures.permission.C2D_MESSAGE
air.com.bitrhymes.bingo.permission.C2D_MESSAGE
air.com.blokekipanarejonie.permission.C2D_MESSAGE
air.com.boostr.FR.permission.C2D_MESSAGE
air.com.brightsolid.familyhouse.permission.C2D_MESSAGE
air.com.buffalo_studios.bingorush2.permission.C2D_MESSAGE
air.com.buffalo_studios.newflashbingo.permission.C2D_MESSAGE
air.com.cardsandcastles.game.permission.C2D_MESSAGE
air.com.cellap.balloonsquash.permission.C2D_MESSAGE
air.com.ciqueis.slots0918.permission.C2D_MESSAGE
air.com.classicslotgalaxy.permission.C2D_MESSAGE
air.com.classicslotgalaxy.permission.RECEIVE_ADM_MESSAGE
air.com.classteacher.main.permission.C2D_MESSAGE
air.com.coalaa.itexaspro.ph.permission.C2D_MESSAGE
air.com.come2play.backgammon.permission.C2D_MESSAGE
air.com.cupcakedigital.frgl.gameday.free.permission.C2D_MESSAGE
air.com.deadzone.zombiecrisis.permission.C2D_MESSAGE
air.com.differencegames.hiddenscenes.wondersfree.permission.C2D_MESSAGE
air.com.differencegames.hocinderellafree.permission.C2D_MESSAGE
air.com.differencegames.hosummergardenfree.permission.C2D_MESSAGE
air.com.dishtv.AndroidZEECommercial.permission.C2D_MESSAGE
air.com.dittotv.AndroidZEECommercial.permission.C2D_MESSAGE
air.com.epic.bengalipanjika.permission.C2D_MESSAGE
air.com.epic.hinducalendarpanchang.permission.C2D_MESSAGE
air.com.fanatee.letroca.permission.C2D_MESSAGE
air.com.fanatee.wordrace.permission.C2D_MESSAGE
air.com.feerik.eredanbattle.debug.permission.C2D_MESSAGE
air.com.feerik.eredanbattle.permission.C2D_MESSAGE
air.com.feerik.gg.battle.debug.permission.C2D_MESSAGE
air.com.feerik.gg.battle.permission.C2D_MESSAGE
air.com.fictionlabs.apobondoehni.permission.C2D_MESSAGE
air.com.flgames.tekadialog.permission.C2D_MESSAGE
air.com.francetv.slammobile.permission.C2D_MESSAGE
air.com.freshplanet.apps.HelloPop.permission.C2D_MESSAGE
air.com.freshplanet.games.MoviePop.permission.C2D_MESSAGE
air.com.freshplanet.games.WaM.permission.C2D_MESSAGE
air.com.fs.estimation.permission.C2D_MESSAGE
air.com.game.danhbaionline.permission.C2D_MESSAGE
air.com.gamedangian.binh.permission.C2D_MESSAGE
air.com.gamedanhbaidoithuong.b247.permission.C2D_MESSAGE
air.com.gamegos.mobile.fashcup.permission.C2D_MESSAGE
air.com.games2win.kursicricket.permission.C2D_MESSAGE
air.com.gamo.monitoring.permission.C2D_MESSAGE
air.com.generamobile.colormaniaguess.permission.C2D_MESSAGE
air.com.generamobile.kingcraft.permission.C2D_MESSAGE
air.com.gerwinsoftware.quizpanic.permission.C2D_MESSAGE
air.com.gerwinsoftware.superbuzzer2.permission.C2D_MESSAGE
air.com.goodgamestudios.empirefourkingdoms.permission.C2D_MESSAGE
air.com.goodgamestudios.empirefourkingdoms.polska.permission.C2D_MESSAGE
air.com.hoiquan52.choibaionline.permission.C2D_MESSAGE
air.com.huyenthoai.i.cenvip.permission.C2D_MESSAGE
air.com.ia.CinepolisLuxury.permission.C2D_MESSAGE
air.com.ievogames.superbingo.permission.C2D_MESSAGE
air.com.ievogames.superbingo.permission.UA_DATA
air.com.innogames.enterprise.grepolis.debug.permission.C2D_MESSAGE
air.com.innogames.enterprise.grepolis.permission.C2D_MESSAGE
air.com.innogames.grepolis.debug.permission.C2D_MESSAGE
air.com.innogames.grepolis.permission.C2D_MESSAGE
air.com.interactech.moovz.permission.C2D_MESSAGE
air.com.izmo.flappyselfie.permission.C2D_MESSAGE
air.com.jogatina.domino.android.permission.C2D_MESSAGE
air.com.joyfort.CityofDecay.permission.C2D_MESSAGE
air.com.joyfort.DeadZone.permission.C2D_MESSAGE
air.com.launchday.mobile.callofduty.permission.C2D_MESSAGE
air.com.lazyland.candy.permission.C2D_MESSAGE
air.com.mastertigra.vreale.permission.C2D_MESSAGE
air.com.migme.bingohighscore.permission.C2D_MESSAGE
air.com.mrtigra.gnomenations.permission.C2D_MESSAGE
air.com.nbcuni.com.nbcsports.liveextra.permission.C2D_MESSAGE
air.com.nbcuni.com.nbcsports.liveextra.permission.RECEIVE_ADM_MESSAGE
air.com.nbcuni.com.nbcsports.liveextra.permission.UA_DATA
air.com.neon.games.WBT.permission.C2D_MESSAGE
air.com.p111.mgames.permission.C2D_MESSAGE
air.com.pacific.enterprises.fruitland.permission.C2D_MESSAGE
air.com.pacific.enterprises.fruitland.vk.permission.C2D_MESSAGE
air.com.pipastudios.release.casinomagic.permission.C2D_MESSAGE
air.com.playcus.bingostars.permission.C2D_MESSAGE
air.com.playcus.bingostars.permission.UA_DATA
air.com.playtika.cvs.permission.C2D_MESSAGE
air.com.productmadness.atlas.permission.C2D_MESSAGE
air.com.pushnotification.permission.C2D_MESSAGE
air.com.qublix.bubblerescue.permission.C2D_MESSAGE
air.com.qublix.forestrescue.permission.C2D_MESSAGE
air.com.qublix.forestrescuetwo.permission.C2D_MESSAGE
air.com.readysquare.ustawka.permission.C2D_MESSAGE
air.com.rosapp.AlfabetEngLite.permission.C2D_MESSAGE
air.com.rosapp.babytunesfree.permission.C2D_MESSAGE
air.com.secretbuilders.permissions.PAYMENT_KUR_BROADCAST_PERMISSION
air.com.sgn.cookiejam.gp.permission.C2D_MESSAGE
air.com.sgn.cookiejamblast.gp.permission.C2D_MESSAGE
air.com.sgn.juicejam.gp.permission.C2D_MESSAGE
air.com.smashatom.bingo.permission.C2D_MESSAGE
air.com.smileygamer.christmassweeper3.permission.C2D_MESSAGE
air.com.smileygamer.farmcharm.permission.C2D_MESSAGE
air.com.spicerackmedia.bingoshowdown.permission.C2D_MESSAGE
air.com.sq.kitchen.int.permission.C2D_MESSAGE
air.com.sublinet.fancytale.permission.C2D_MESSAGE
air.com.sublinet.footballchampions.permission.C2D_MESSAGE
air.com.tamalaki.hmthree.free.permission.C2D_MESSAGE
air.com.tamalaki.maryknots.free.permission.C2D_MESSAGE
air.com.tamalaki.mysteryvenuetwofree.permission.C2D_MESSAGE
air.com.teknobug.analizteam.permission.C2D_MESSAGE
air.com.thumbspire.get13.permission.C2D_MESSAGE
air.com.tornadogames.barshot.permission.C2D_MESSAGE
air.com.tornadogames.casefilesvegvillemystery.permission.C2D_MESSAGE
air.com.tornadogames.ipokersocialfull.permission.C2D_MESSAGE
air.com.tornadogames.junglefruit.permission.C2D_MESSAGE
air.com.tornadogames.openmouthphrases.permission.C2D_MESSAGE
air.com.tornadogames.p156flexfree2.permission.C2D_MESSAGE
air.com.turbonuke.dirtbikeracing.permission.C2D_MESSAGE
air.com.tutotoons.app.animalhairsalon.permission.C2D_MESSAGE
air.com.ubisoft.csi.HiddenCrimes.permission.C2D_MESSAGE
air.com.ubisoft.ncis.permission.C2D_MESSAGE
air.com.voodoo.quizrun.permission.C2D_MESSAGE
air.com.zanorg.lesjeuxchiantsgratuit.permission.C2D_MESSAGE
air.cp.gamebai.langtoidoithuong.permission.C2D_MESSAGE
air.cumaceban.com.permission.C2D_MESSAGE
air.customerAPP.permission.C2D_MESSAGE
air.cz.fit.paska.fishtrone.permission.C2D_MESSAGE
air.cz.fit.paska.mozgownica.permission.C2D_MESSAGE
air.danhbaidoithuong.awin.permission.C2D_MESSAGE
air.danhbaidoithuong.doithe.qgame.permission.C2D_MESSAGE
air.danhbaidoithuong.doithe.xgame.permission.C2D_MESSAGE
air.danhbaidoithuong.net.permission.C2D_MESSAGE
air.de.goalgames.GoalManagerDev.permission.C2D_MESSAGE
air.dri.permission.C2D_MESSAGE
air.eu.bandainamcoent.asterixandfriends.permission.C2D_MESSAGE
air.fire.game.zombiewar.dead.clashking.permission.C2D_MESSAGE
air.flirtymania.videochat.permission.C2D_MESSAGE
air.gamebai.doithuong.jokerpro.permission.C2D_MESSAGE
air.gamebaidoithuong.danhbai.doithe.permission.C2D_MESSAGE
air.gamebaidoithuong.doithe.2016.permission.C2D_MESSAGE
air.gamebaidoithuong.doithe.lvc.vip.permission.C2D_MESSAGE
air.gamebaidoithuong.vip.permission.C2D_MESSAGE
air.jp.co.fujitv.fodviewer.permission.C2D_MESSAGE
air.kazi.permission.C2D_MESSAGE
air.kukulive.mailnow.permission.C2D_MESSAGE
air.kukulive.mailnow.permission.RECEIVE_ADM_MESSAGE
air.langvuichoi2.com.permission.C2D_MESSAGE
air.lvc.gamebaidoithe.tung54.permission.C2D_MESSAGE
air.meez.app.Towers.permission.C2D_MESSAGE
air.net.danhbaidoithuong.88fun.permission.C2D_MESSAGE
air.net.endemolgames.dond.noelsquiz.permission.C2D_MESSAGE
air.net.endemolgames.flyingteddy.permission.C2D_MESSAGE
air.net.siteexpert.extremeshooting.permission.C2D_MESSAGE
air.net.siteexpert.waiter.permission.C2D_MESSAGE
air.nn.mobile.app.main.permission.C2D_MESSAGE
air.ru.mail.games.backgammonlong.permission.C2D_MESSAGE
air.ru.pragmatix.wormix.mobile.permission.C2D_MESSAGE
air.ru.vigr.mushroomers2.permission.C2D_MESSAGE
air.sudokuPuzzleFree.permission.C2D_MESSAGE
air.tv.cube.catchphrase.permission.C2D_MESSAGE
air.tv.mhub.enterprise.mhubviewerCSCMyLaunch.permission.C2D_MESSAGE
air.tv.mhub.enterprise.mhubviewerCSCMyLaunch.permission.UA_DATA
air.uk.co.cubeinteractive.FamilyFortunes.permission.C2D_MESSAGE
air.www.danhbaidoithuong.net.permission.C2D_MESSAGE
ak.tvviet12.permission.C2D_MESSAGE
akmin.sitebuilder.permission.C2D_MESSAGE
al.ontv.arlind.permission.C2D_MESSAGE
ali.alhadidi.gif_facebook.permission.C2D_MESSAGE
all.in.one.calculator.permission.C2D_MESSAGE
allinoneshopping_3592.permission.C2D_MESSAGE
allthetopbananas.cvlibrary.permission.C2D_MESSAGE
alternative.video.chat.live.chatroulette.straight.bisexual.gcm.permission.C2D_MESSAGE
alternative.video.chat.live.chatroulette.straight.bisexual.permission.C2D_MESSAGE
alve.apps.fashion.permission.C2D_MESSAGE
am.casino.barahatayo.permission.C2D_MESSAGE
am.ggtaxi.main.ggdriver.permission.C2D_MESSAGE
am.ggtaxi.main.permission.C2D_MESSAGE
am.ggtaxi.main.permission.MAPS_RECEIVE
am.hovo.carhud.permission.C2D_MESSAGE
amazon.permission.COLLECT_METRICS
american.chatmeetfriends.permission.C2D_MESSAGE
amina.app.makemeslim.permission.C2D_MESSAGE
amitech.twok16.amitech16.permission.C2D_MESSAGE
amos.hexalite.com.customer.permission.C2D_MESSAGE
amplified.bible.app.permission.C2D_MESSAGE
amplified.bible.permission.C2D_MESSAGE
anastasia.match.date.dating.meet.singles.chat.flirt.people.single.guide.permission.C2D_MESSAGE
anddroid.permission.CHANGE_WIFI_MULTICAST_STATE
andoid.permission.INTERNET
andorid.permission.CHANGE_CONFIGURATION
andrewgilman.dartsscoreboard.permission.C2D_MESSAGE
androdi.permission.ACCESS_COARSE_LOCATION
android.Manifest.permission.ACCESS_FINE_LOCATION
android.Manifest.permission.AUTHENTICATE_ACCOUNTS
android.Manifest.permission.BLUETOOTH
android.Manifest.permission.DEVICE_POWER
android.Manifest.permission.FORCE_STOP_PACKAGES
android.Manifest.permission.GET_TASKS
android.Manifest.permission.KILL_BACKGROUND_PROCESSES
android.Manifest.permission.MEDIA_CONTENT_CONTROL
android.Manifest.permission.READ_PHONE_STATE
android.Manifest.permission.READ_SMS
android.Manifest.permission.RECEIVE_BOOT_COMPLETED
android.alarm.permission.SET_ALARM
android.appsflyer.sampleapp.permission.C2D_MESSAGE
android.gcm.permission.C2D_MESSAGE
android.launcher.permission.READ_SETTINGS
android.permission-group.LOCATION
android.permission-group.MICROPHONE
android.permission-group.NETWORK
android.permission-group.SOCIAL_INFO
android.permission-group.STORAGE
android.permission..BILLING
android.permission..permission.READ_HISTORY_BOOKMARKS
android.permission..permission.WRITE_HISTORY_BOOKMARKS
android.permission.ACCELEROMETER
android.permission.ACCESS_4G_STATE
android.permission.ACCESS_ALL_DOWNLOAD
android.permission.ACCESS_ALL_DOWNLOADS
android.permission.ACCESS_ALL_EXTERNAL_STORAGE
android.permission.ACCESS_ASSISTED_GPS
android.permission.ACCESS_BACKGROUND_SERVICE
android.permission.ACCESS_BLUETOOTH_SHARE
android.permission.ACCESS_CACHE_FILESYSTEM
android.permission.ACCESS_CELL_ID
android.permission.ACCESS_CHECKIN_PROPERTIES
android.permission.ACCESS_CHECKIN_PROPERTIES.permission.C2D_MESSAGE
android.permission.ACCESS_CLOCK_WIDGET
android.permission.ACCESS_COARSE
android.permission.ACCESS_COARSE_LOCATION
android.permission.ACCESS_COARSE_UPDATE
android.permission.ACCESS_COARSE_UPDATES
android.permission.ACCESS_COARWAKE_LOCKSE_LOCATION
android.permission.ACCESS_CORSE_LOCATION
android.permission.ACCESS_COURSE_LOCATION
android.permission.ACCESS_DEVICE_STATS
android.permission.ACCESS_DOWNLOAD_MANAGER
android.permission.ACCESS_DOWNLOAD_MANAGER_ADVANCED
android.permission.ACCESS_DRM
android.permission.ACCESS_EXTERNAL_STORAGE
android.permission.ACCESS_FIND_LOCATION
android.permission.ACCESS_FINE_LOCATI
android.permission.ACCESS_FINE_LOCATIION
android.permission.ACCESS_FINE_LOCATION
android.permission.ACCESS_FINE_LOCATION.INTERNET
android.permission.ACCESS_FINE_LOCATIONp
android.permission.ACCESS_GPS
android.permission.ACCESS_HTC_MDM_API
android.permission.ACCESS_INTERNET_LOCATION
android.permission.ACCESS_KEYGUARD_SECURE_STORAGE
android.permission.ACCESS_LOCATION
android.permission.ACCESS_LOCATION_EXTRA_COMMANDS
android.permission.ACCESS_MEDIUM_LOCATION
android.permission.ACCESS_MOCK_LOCATION
android.permission.ACCESS_MTK_MMHW
android.permission.ACCESS_NETWORK
android.permission.ACCESS_NETWORK_CHANGE
android.permission.ACCESS_NETWORK_CONDITIONS
android.permission.ACCESS_NETWORK_CONFIGURATION
android.permission.ACCESS_NETWORK_STATE
android.permission.ACCESS_NETWORK_STATE_STATE
android.permission.ACCESS_NETWORK_STAaaTE
android.permission.ACCESS_NOTIFICATIONS
android.permission.ACCESS_NOTIFICATION_POLICY
android.permission.ACCESS_PHONE_STATE
android.permission.ACCESS_PROVIDER
android.permission.ACCESS_SUPERUSER
android.permission.ACCESS_SURFACE_FLINGER
android.permission.ACCESS_UPLOAD_DATA
android.permission.ACCESS_UPLOAD_MANAGER
android.permission.ACCESS_VOICE_INTERACTION_SERVICE
android.permission.ACCESS_WAKE_LOCK
android.permission.ACCESS_WEATHERCLOCK_PROVIDER
android.permission.ACCESS_WIFI_STATE
android.permission.ACCESS_WIMAX_STATE
android.permission.ACCES_MOCK_LOCATION
android.permission.ACCES_NETWORK_STATE
android.permission.ACCOUNT_MANAGER
android.permission.ACC_LOCATION
android.permission.ACQUIRE_CAUSES_WAKEUP
android.permission.ACTION_BATTERY_CHANGED
android.permission.ACTION_BOOT_COMPLETED
android.permission.ACTION_DIAL
android.permission.ACTION_HEADSET_PLUG
android.permission.ACTION_LOCATION_SOURCE_SETTINGS
android.permission.ACTION_MEDIA_SCANNER_SCAN_FILE
android.permission.ACTION_SHUTDOWN
android.permission.ADD_SYSTEM_SERVICE
android.permission.ADVANCED_WIDGET_API
android.permission.ALLOW_ANY_CODEC_FOR_PLAYBACK
android.permission.ALLOW_MOCK_LOCATIONS
android.permission.ANSWER_PHONE
android.permission.AUDIO_EFFECTS
android.permission.AUTHENTICATE_ACCOUNTS
android.permission.Access_
android.permission.Access_MOCK_LOCATION
android.permission.BACKUP
android.permission.BACKUP_DATA
android.permission.BAIDU_LOCATION_SERVICE
android.permission.BATTERY_CHANGED_ACTION
android.permission.BATTERY_STATS
android.permission.BILLING
android.permission.BIND_ACCESSIBILITY_SERVICE
android.permission.BIND_APPWIDGET
android.permission.BIND_DEVICE_ADMIN
android.permission.BIND_DIRECTORY_SEARCH
android.permission.BIND_INCALL_SERVICE
android.permission.BIND_INPUT_METHOD
android.permission.BIND_JOB_SERVICE
android.permission.BIND_NOTIFICATION_LISTENER_SERVICE
android.permission.BIND_PRINT_SERVICE
android.permission.BIND_REMOTEVIEWS
android.permission.BIND_WALLPAPER
android.permission.BLUETOOTH
android.permission.BLUETOOTH_ADMIN
android.permission.BLUETOOTH_PRIVILEDGE
android.permission.BLUETOOTH_PRIVILEGED
android.permission.BLUETOOTH_STACK
android.permission.BODY_SENSORS
android.permission.BOOT_COMPLETED
android.permission.BROADCAST
android.permission.BROADCAST_PACKAGE_ADDED
android.permission.BROADCAST_PACKAGE_CHANGED
android.permission.BROADCAST_PACKAGE_INSTALL
android.permission.BROADCAST_PACKAGE_REMOVED
android.permission.BROADCAST_PACKAGE_REPLACED
android.permission.BROADCAST_SMS
android.permission.BROADCAST_STICKY
android.permission.BROADCAST_WAP_PUSH
android.permission.C2D_MESSAGE
android.permission.CALL_EMERGENCY_NUMBERS
android.permission.CALL_PHONE
android.permission.CALL_PRIVELEGED
android.permission.CALL_PRIVILEGED
android.permission.CAM
android.permission.CAMERA
android.permission.CAMERA_EXTENDED
android.permission.CAPTURE_AUDIO_HOTWORD
android.permission.CAPTURE_AUDIO_OUTPUT
android.permission.CAPTURE_SECURE_VIDEO_OUTPUT
android.permission.CAPTURE_VIDEO_OUTPUT
android.permission.CESS_COARSE_LOCATION
android.permission.CHANGE_4G_STATE
android.permission.CHANGE_BACKGROUND_DATA_SETTING
android.permission.CHANGE_COMPONENT_ENABLED_STATE
android.permission.CHANGE_CONFIGURATION
android.permission.CHANGE_DEVICE_IDLE_TEMP_WHITELIST
android.permission.CHANGE_NETWORK
android.permission.CHANGE_NETWORK_STATE
android.permission.CHANGE_PHONE_STATE
android.permission.CHANGE_WIFI_MULTICAST_STAT
android.permission.CHANGE_WIFI_MULTICAST_STATE
android.permission.CHANGE_WIFI_STATE
android.permission.CHANGE_WIMAX_STATE
android.permission.CHECK_LICENSE
android.permission.CLEAR_APP_CACHE
android.permission.CLEAR_APP_USER_DATA
android.permission.CLOSE_SYSTEM_DIALOGS
android.permission.CODE_WRITE_SETTINGS_PERMISSION
android.permission.COM_WSSNPS
android.permission.CONFIGURE_SIP
android.permission.CONFIGURE_WIFI_DISPLAY
android.permission.CONNECTIVITY_CHANGE
android.permission.CONNECTIVITY_INTERNAL
android.permission.CONNECTIVITY_INTERNET
android.permission.CONNECTIVITY_SERVICE
android.permission.CONNECTIVITY_USE_RESTRICTED_NETWORKS
android.permission.CONTROL_INCALL_EXPERIENCE
android.permission.CONTROL_KEYGUARD
android.permission.CONTROL_LOCATION_UPDATES
android.permission.CONTROL_VPN
android.permission.CREATE_ACCOUNTS
android.permission.Change_NETWORK_STATE
android.permission.DELETE_CACHE_FILES
android.permission.DELETE_PACKAGES
android.permission.DEVICE_POWER
android.permission.DIAGNOSTIC
android.permission.DIAL_PHONE
android.permission.DISABLE_KEYGUARD
android.permission.DISABLE_STATUS_BAR
android.permission.DOWNLOAD_WITHOUT_NOTIFICATION
android.permission.DUMP
android.permission.EXPAND_STATUS_BAR
android.permission.EXTRA_OUTPUT
android.permission.EXTRA_STREAM
android.permission.FACTURATION
android.permission.FINE_LOCATION
android.permission.FINGERPRINT_ENROLL
android.permission.FINGERPRINT_VERIFY
android.permission.FLAG_ACTIVITY_NEW_TASK
android.permission.FLAG_GRANT_READ_URI_PERMISSION
android.permission.FLAG_KEEP_SCREEN_ON
android.permission.FLAG_SHOW_WHEN_LOCKED
android.permission.FLASHAUTO
android.permission.FLASHLIGHT
android.permission.FORCE_KILL
android.permission.FORCE_STOP_PACKAGES
android.permission.FULLSCREEN
android.permission.GET_ACCOUNT
android.permission.GET_ACCOUNTS
android.permission.GET_ACCOUNTS_PRIVILEGED
android.permission.GET_APP_OPS_STATS
android.permission.GET_CLIPS
android.permission.GET_DETAILED_TASKS
android.permission.GET_PACKAGE_IMPORTANCE
android.permission.GET_PACKAGE_SIZE
android.permission.GET_PERMISSIONS
android.permission.GET_REALTASKS
android.permission.GET_REAL_TASKS
android.permission.GET_TASK
android.permission.GET_TASKS
android.permission.GET_TOP_ACTIVITY_INFO
android.permission.GLOBAL_SEARCH
android.permission.GPS_ENABLED_CHANGE
android.permission.GRANT_RUNTIME_PERMISSIONS
android.permission.GYROSCOPE
android.permission.HARDWARE_TEST
android.permission.HOTKNOT
android.permission.HUAWEI_SYSTEM_NODE_ACCESS
android.permission.HW_SIGNATURE_OR_SYSTEM
android.permission.INJECT_EVENT
android.permission.INJECT_EVENTS
android.permission.INSTALL_DRM
android.permission.INSTALL_GRANT_RUNTIME_PERMISSIONS
android.permission.INSTALL_LOCATION_PROVIDER
android.permission.INSTALL_PACKAGES
android.permission.INSTALL_SHORTCUT
android.permission.INTENT_FILTER_VERIFICATION_AGENT
android.permission.INTERACT_ACROSS_USERS
android.permission.INTERACT_ACROSS_USERS_FULL
android.permission.INTERACT_ACROSS_USER_FULL
android.permission.INTERNAL_SYSTEM_WINDOW
android.permission.INTERNET
android.permission.INTERNET_ACCESS
android.permission.Internet
android.permission.KILL_BACKGROUND_PROCESSES
android.permission.LISTEN_DATA_ACTIVITY
android.permission.LISTEN_DATA_CONNECTION_STATE
android.permission.LOCAL_MAC_ADDRESS
android.permission.LOCATION
android.permission.LOCATION_HARDWARE
android.permission.MAGNETOMETER
android.permission.MANAGE_ACCOUNTS
android.permission.MANAGE_ACTIVITY_STACKS
android.permission.MANAGE_CA_CERTIFICATES
android.permission.MANAGE_DEVICE_ADMINS
android.permission.MANAGE_DOCUMENTS
android.permission.MANAGE_FINGERPRINT
android.permission.MANAGE_MEDIA_PROJECTION
android.permission.MANAGE_NETWORK_POLICY
android.permission.MANAGE_NOTIFICATIONS
android.permission.MANAGE_SOUND_TRIGGER
android.permission.MANAGE_USB
android.permission.MANAGE_USERS
android.permission.MANAGE_VOICE_KEYPHRASES
android.permission.MANAGE_WRITE_SETTINGS
android.permission.MAPS_RECEIVE
android.permission.MASTER_CLEAR
android.permission.MEDIA_CONTENT_CONTROL
android.permission.MEDIA_MO
android.permission.MEDIA_MOUNTED
android.permission.MEDIA_REMOVED_ACTION
android.permission.MIC
android.permission.MICROPHONE
android.permission.MMS_PUSH
android.permission.MMS_SEND_OUTBOX_MSG
android.permission.MOCK
android.permission.MOCK_ACCESS_LOCATION
android.permission.MOCK_LOCATIONS
android.permission.MODE_WORLD_READABLE
android.permission.MODE_WORLD_WRITEABLE
android.permission.MODIFY_AUDIO_ROUTING
android.permission.MODIFY_AUDIO_SETTING
android.permission.MODIFY_AUDIO_SETTINGS
android.permission.MODIFY_NETWORK_ACCOUNTING
android.permission.MODIFY_PHONE_STATE
android.permission.MODIFY_PcHONE_STATE
android.permission.MOUNT_FORMAT_FILESYSTEMS
android.permission.MOUNT_UNMOUNT_FILESYS
android.permission.MOUNT_UNMOUNT_FILESYSTEMS
android.permission.MOUNT_UNMOUNT_FILESYSTEMSWRITE_CONTACTS
android.permission.MOVE_PACKAGE
android.permission.NETWORK
android.permission.NETWORK_ACCESS
android.permission.NETWORK_PROVIDER
android.permission.NETWORK_STATE
android.permission.NETWORK_STATE_CHANGED_ACTION
android.permission.NET_ADMIN
android.permission.NET_CANBUS
android.permission.NET_RAW
android.permission.NEW_GET_TASKS
android.permission.NEW_OUTGOING_CALL
android.permission.NFC
android.permission.NOTIFY_PENDING_SYSTEM_UPDATE
android.permission.NVIDIA_CPU_POWER
android.permission.OBSERVE_GRANT_REVOKE_PERMISSIONS
android.permission.OVERRIDE_WIFI_CONFIG
android.permission.PACKAGE_USAGE_STATS
android.permission.PACKAGE_VERIFICATION_AGENT
android.permission.PARTIAL_WAKE_LOCK
android.permission.PEAD_PHONE_STATE
android.permission.PEERS_MAC_ADDRESS
android.permission.PERMISSION.READ_LOGS
android.permission.PERMISSION_GRANTED
android.permission.PERMISSION_NAME
android.permission.PERSISTENT_ACTIVITY
android.permission.PHONE_CALLS
android.permission.PHONE_STATE
android.permission.PHONE_STATE_STATE
android.permission.PICK_CONTACT
android.permission.PLAY_AUDIO
android.permission.PREVENT_POWER_KEY
android.permission.PRIORITY_HIGH_ACCURACY
android.permission.PROCESS_INCOMING_CALLS
android.permission.PROCESS_OUTGOING_CALLS
android.permission.PROVIDE_TRUST_AGENT
android.permission.QUICKBOOT_POWERON
android.permission.RAISED_THREAD_PRIORITY
android.permission.READ
android.permission.READ_AIRSHOU_COMPOSER
android.permission.READ_APN_SETTINGS
android.permission.READ_APP_BADGE
android.permission.READ_ATTACHMENT
android.permission.READ_CALENDAR
android.permission.READ_CALLRECORD
android.permission.READ_CALL_LOG
android.permission.READ_CELL_BROADCASTS
android.permission.READ_CLIPS
android.permission.READ_CONTACTS
android.permission.READ_DREAM_STATE
android.permission.READ_EXTERNAL_STORAGE
android.permission.READ_EXTERNAL_STORAGED
android.permission.READ_EXTERNAL_STORAGEE
android.permission.READ_EXTERNAL_STORAGE_EXTERNAL_STORAGE
android.permission.READ_FRAMEBUFFER
android.permission.READ_FRAME_BUFFER
android.permission.READ_GMAIL
android.permission.READ_GSERVICES
android.permission.READ_HISTORY_BOOKMARKS
android.permission.READ_INPUT_STATE
android.permission.READ_INSTALL_SESSIONS
android.permission.READ_INTERNAL_STORAGE
android.permission.READ_INTERNAL_STROAGE
android.permission.READ_LOCAL_STORAGE
android.permission.READ_LOGS
android.permission.READ_MEDIA_STORAGE
android.permission.READ_MMS
android.permission.READ_NETWORK_STATE
android.permission.READ_NETWORK_USAGE_HISTORY
android.permission.READ_OEM_UNLOCK_STATE
android.permission.READ_OWNER_DATA
android.permission.READ_PHONE_SINTERNETWIFI_STATE
android.permission.READ_PHONE_STAT
android.permission.READ_PHONE_STATE
android.permission.READ_PRECISE_PHONE_STATE
android.permission.READ_PRIVILEGED_PHONE_STATE
android.permission.READ_PROFILE
android.permission.READ_SECURE_SETTINGS
android.permission.READ_SETTINGS
android.permission.READ_SHOUTV_COMPOSER
android.permission.READ_SMS
android.permission.READ_SOCIAL_STREAM
android.permission.READ_SYNC_SETTINGS
android.permission.READ_SYNC_STATS
android.permission.READ_TASK
android.permission.READ_TASKS
android.permission.READ_USER_DICTIONARY
android.permission.READ_WIFI_CREDENTIAL
android.permission.REAL_GET_TASKS
android.permission.REATE_EXTERNAL_STORAGE
android.permission.REBOOT
android.permission.REBOOT_IPO
android.permission.RECEIVE
android.permission.RECEIVE_ACTION_PACKAGE_ADDED
android.permission.RECEIVE_ACTION_PACKAGE_REPLACED
android.permission.RECEIVE_BOOT_COMPLETE
android.permission.RECEIVE_BOOT_COMPLETED
android.permission.RECEIVE_CB_SMS
android.permission.RECEIVE_DATA_ACTIVITY_CHANGE
android.permission.RECEIVE_LAUNCH_BROADCASTS
android.permission.RECEIVE_MMS
android.permission.RECEIVE_SMS
android.permission.RECEIVE_USER_PRESENT
android.permission.RECEIVE_WAP_PUSH
android.permission.RECIEVE_SMS
android.permission.RECORD_AUDIO
android.permission.RECORD_VIDEO
android.permission.RECOVERY
android.permission.REGISTER_CALL_PROVIDER
android.permission.REGISTER_CONNECTION_MANAGER
android.permission.REMOVE_PACKAGES
android.permission.REMOVE_TASKS
android.permission.REORDER_TASKS
android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS
android.permission.REQUEST_INSTALL_PACKAGES
android.permission.RESET_BATTERY_STATS
android.permission.RESTART_PACKAGE
android.permission.RESTART_PACKAGES
android.permission.REVOKE_RUNTIME_PERMISSIONS
android.permission.REad_EXTERNAL_STORAGE
android.permission.RS_BLUETOOTH
android.permission.RS_GRAPHICS
android.permission.RS_INPUT
android.permission.RUN_INSTRUMENTATION
android.permission.SCORE_NETWORKS
android.permission.SCREEN_OFF
android.permission.SCREEN_ON
android.permission.SDCARD_WRITE
android.permission.SECURITY_ACTIVITY
android.permission.SEND_DOWNLOAD_COMPLETED_INTENTS
android.permission.SEND_EMAIL
android.permission.SEND_RESPOND_VIA_MESSAGE
android.permission.SEND_SMS
android.permission.SEND_SMS_NO_CONFIRMATION
android.permission.SEND_UPLOAD_COMPLETED_INTENTS
android.permission.SENSOR
android.permission.SENSOR_ENABLE
android.permission.SENSOR_INFO
android.permission.SET_ACTIVITY_WATCHER
android.permission.SET_ALARM
android.permission.SET_ALWAYS_FINISH
android.permission.SET_ANIMATION_SCALE
android.permission.SET_DEBUG_APP
android.permission.SET_KEYBOARD_LAYOUT
android.permission.SET_ORIENTATION
android.permission.SET_PREFERRED_APPLICATIONS
android.permission.SET_PROCESS_LIMIT
android.permission.SET_TIME
android.permission.SET_TIME_ZONE
android.permission.SET_WALLPAPER
android.permission.SET_WALLPAPER_COMPONENT
android.permission.SET_WALLPAPER_HINT
android.permission.SET_WALLPAPER_HINTS
android.permission.SHAKE
android.permission.SHORTCUT
android.permission.SIGNAL_PERSISTENT_PROCESSES
android.permission.SIM_STATE_READY
android.permission.START_ANY_ACTIVITY
android.permission.START_BACKGROUND_SERVICE
android.permission.START_TASKS_FROM_RECENTS
android.permission.STATUS_BAR
android.permission.STATUS_BAR_SERVICE
android.permission.STOP_APP_SWITCHES
android.permission.STORAGE
android.permission.SUBSCRIBED_FEEDS_READ
android.permission.SUBSCRIBED_FEEDS_WRITE
android.permission.SUBSTITUTE_NOTIFICATION_APP_NAME
android.permission.SYSTEM_ALERT
android.permission.SYSTEM_ALERT_WINDOW
android.permission.SYSTEM_DIALOG_WINDOW
android.permission.SYSTEM_ERROR_WINDOW
android.permission.SYSTEM_OVERLAY_WINDOW
android.permission.SurfaceFlinger
android.permission.TETHER_PRIVILEGED
android.permission.TRANSMIT_IR
android.permission.TRUST_LISTENER
android.permission.UNINSTALL_SHORTCUT
android.permission.UPDATE_APP_OPS_STATS
android.permission.UPDATE_CONFIG
android.permission.UPDATE_DEVICE_STATS
android.permission.USB
android.permission.USB_PERMISSION
android.permission.USER_ACTIVITY
android.permission.USER_CREDENTIALS
android.permission.USES_LOG_UPLOAD_SERVICE
android.permission.USES_POLICY_FORCE_LOCK
android.permission.USES_POLICY_REBOOT
android.permission.USES_POLICY_RESET_PASSWORD
android.permission.USE_ACCOUNTS
android.permission.USE_CREDENTIALS
android.permission.USE_FINGERPRINT
android.permission.USE_SIP
android.permission.VIBRATE
android.permission.VIBRATION
android.permission.VIBRATOR
android.permission.VOICE_RECOGNITION
android.permission.VPN
android.permission.WAKEDISABLE_KEYGUARD
android.permission.WAKE_CLOCK
android.permission.WAKE_LOCK
android.permission.WIFI
android.permission.WIFI_LOCK
android.permission.WIFI_STATE
android.permission.WIFI_STATE_CHANGED
android.permission.WRIESS_NETWORK_STATE
android.permission.WRITE
android.permission.WRITE_APN_SETTINGS
android.permission.WRITE_APP_BADGE
android.permission.WRITE_CALENDAR
android.permission.WRITE_CALLRECORD
android.permission.WRITE_CALL_LOG
android.permission.WRITE_CLIPS
android.permission.WRITE_CONTACTS
android.permission.WRITE_EXERNAL_STORAGE
android.permission.WRITE_EXTERNALS_STORAGE
android.permission.WRITE_EXTERNAL_STORAGE
android.permission.WRITE_GLOBAL_SETTINGS
android.permission.WRITE_HISTORY_BOOKMARKS
android.permission.WRITE_INERNAL_STORAGE
android.permission.WRITE_INTERAL_STORAGE
android.permission.WRITE_INTERNAL_STORAGE
android.permission.WRITE_INTERNAL_STORATE
android.permission.WRITE_INTERNAL_STROAGE
android.permission.WRITE_LOCAL_STORAGE
android.permission.WRITE_MEDIA_STORAG
android.permission.WRITE_MEDIA_STORAGE
android.permission.WRITE_MMS
android.permission.WRITE_OWNER_DATA
android.permission.WRITE_PROFILE
android.permission.WRITE_SDCARD
android.permission.WRITE_SECURE_SETTINGS
android.permission.WRITE_SETTINGS
android.permission.WRITE_SMS
android.permission.WRITE_SOCIAL_STREAM
android.permission.WRITE_ST
android.permission.WRITE_STORAGE
android.permission.WRITE_SYNC_SETTINGS
android.permission.WRITE_SYNC_STATS
android.permission.WRITE_SYSTEM_SETTINGS
android.permission.WRITE_TASK
android.permission.WRITE_TASKS
android.permission.WRITE_USER_DICTIONARY
android.permission.WRITE_WAPPUSH
android.permission.Write
android.permission.access_coarse_location
android.permission.access_fine_location
android.permission.access_network_state
android.permission.anddanSET_DEBUG_APP
android.permission.android.permission.BLUETOOTH
android.permission.android.permission.BLUETOOTH_ADMIN
android.permission.android.permission.BLUETOOTH_PRIVILEGED
android.permission.android.permission.MODIFY_AUDIO_SETTINGS
android.permission.android.permission.READ_PHONE_STATE
android.permission.android.permission.RECORD_AUDIO
android.permission.android.permission.TRANSMIT_IR
android.permission.android.permission.WAKE_LOCK
android.permission.call_phone
android.permission.call_privileged
android.permission.camera
android.permission.com.cavip.online.permission.C2D_MESSAGE
android.permission.com.superbox.aos.brixta.permission.C2D_MESSAGE
android.permission.internet
android.permission.permission.READ_SMS
android.permission.qqmusic.qqcbdm
android.permission.r.permission.INSTALL_SHORTCUT
android.permission.r.permission.UNINSTALL_SHORTCUT
android.permission.read_contacts
android.permission.read_external_storage
android.permission.read_phone_state
android.permission.read_sync_stats
android.permission.record_audio
android.permission.restart_packages
android.permission.sec.ENTERPRISE_CONTAINER
android.permission.sec.ENTERPRISE_DEVICE_ADMIN
android.permission.sec.MDM_APN
android.permission.sec.MDM_APP_MGMT
android.permission.sec.MDM_APP_PERMISSION_MGMT
android.permission.sec.MDM_AUDIT_LOG
android.permission.sec.MDM_BLUETOOTH
android.permission.sec.MDM_BROWSER_SETTINGS
android.permission.sec.MDM_DATE_TIME
android.permission.sec.MDM_EMAIL
android.permission.sec.MDM_ENTERPRISE_CONTAINER
android.permission.sec.MDM_ENTERPRISE_ISL
android.permission.sec.MDM_ENTERPRISE_SSO
android.permission.sec.MDM_ENTERPRISE_VPN
android.permission.sec.MDM_EXCHANGE
android.permission.sec.MDM_FIREWALL
android.permission.sec.MDM_HW_CONTROL
android.permission.sec.MDM_INVENTORY
android.permission.sec.MDM_KIOSK_MODE
android.permission.sec.MDM_LDAP
android.permission.sec.MDM_LICENSE_INTERNAL
android.permission.sec.MDM_LICENSE_LOG
android.permission.sec.MDM_LOCATION
android.permission.sec.MDM_LOCKSCREEN
android.permission.sec.MDM_MULTI_USER_MGMT
android.permission.sec.MDM_PHONE_RESTRICTION
android.permission.sec.MDM_REMOTE_CONTROL
android.permission.sec.MDM_RESTRICTION
android.permission.sec.MDM_ROAMING
android.permission.sec.MDM_SECURITY
android.permission.sec.MDM_VPN
android.permission.sec.MDM_WIFI
android.permission.send_sms
android.permission.set_wallpaper
android.permission.use_credentials
android.permission.vending.BILLING
android.permission.wake_lock
android.permission.web_accessible_resources
android.permission.wr
android.permission.writeSET_TIME_ZONE
android.permission.write_apn_settings
android.permission.write_external_storage
android.permissions.READ_DATABASE
android.permissions.READ_EXTERNAL_STORAGE
android.providers.gsf.permission.READ_GSERVICES
android.russmedia.com.newsportalapps_v3.permission.C2D_MESSAGE
android.tcl.permission.ownreceiver
android.webkit.permission.PLUGIN
androis.permission.READ_EXTERNAL_STORAGE
animation_944.permission.C2D_MESSAGE
anime.musicfree.permission.C2D_MESSAGE
animeslayer.info.animeslayer.permission.C2D_MESSAGE
anonymous.chat.video.roulette.flirt.gcm.permission.C2D_MESSAGE
anonymous.chat.video.roulette.flirt.permission.C2D_MESSAGE
anroid.permission.ACCESS_COARSE_LOCATIONE
anroid.permission.ACCESS_FINE_LOCATION
anroid.permission.ACCESS_MOCK_LOCATION
anroid.permission.ACCESS_NETWORK_STATE
anroid.permission.ACCESS_WIFI_STATE
anroid.permission.CAMERA
anroid.permission.INTERNET
antarctica_24.permission.C2D_MESSAGE
anxdroid.permission.WRITE_EXTERNAL_STORAGE
any.travel.hotels.permission.C2D_MESSAGE
aplicacion.tiempo.permission.C2D_MESSAGE
apolologic.menutodos.permission.C2D_MESSAGE
app.APFCB.permission.C2D_MESSAGE
app.ICPB.permission.C2D_MESSAGE
app.Medcon.permission.C2D_MESSAGE
app.Mptm.permission.C2D_MESSAGE
app.RAB2016.permission.C2D_MESSAGE
app.YBAppDevelopment.seconds60.permission.C2D_MESSAGE
app.akexorcist.googlemapsv2direction.permission.MAPS_RECEIVE
app.ansaluniversity.edu.in.permission.C2D_MESSAGE
app.bundle.identifier.permission.C2D_MESSAGE
app.calleridfaker.com.permission.C2D_MESSAGE
app.cheers.permission.C2D_MESSAGE
app.cloudstringers.permission.C2D_MESSAGE
app.cougary.permission.C2D_MESSAGE
app.dev.nadim.job.permission.C2D_MESSAGE
app.earncash.permission.C2D_MESSAGE
app.fast.homewidgets.com.permission.C2D_MESSAGE
app.getbubbles.me.permission.C2D_MESSAGE
app.manoth.fahsai.permission.C2D_MESSAGE
app.missicon2016.permission.C2D_MESSAGE
app.mobile.one2car.permission.C2D_MESSAGE
app.nucitrus.ceol.permission.C2D_MESSAGE
app.nucitrus.easyappnew.permission.C2D_MESSAGE
app.nucitrus.falcone.permission.C2D_MESSAGE
app.nucitrus.ibwc.permission.C2D_MESSAGE
app.nucitrus.modernmale.permission.C2D_MESSAGE
app.nucitrus.the1086united.permission.C2D_MESSAGE
app.odhair.com.permission.C2D_MESSAGE
app.pnd.fourg.permission.C2D_MESSAGE
app.qrcode.permission.C2D_MESSAGE
app8.ballpoolcoinscash.permission.C2D_MESSAGE
app8.ballpoolcoinscashfree.permission.C2D_MESSAGE
app_package_name.permission.C2D_MESSAGE
appcorp.mmb.permission.C2D_MESSAGE
appinventor.ai_ehka.SinoptikUKR.permission.C2D_MESSAGE
appinventor.ai_mmfrutos7878.Archangels.permission.C2D_MESSAGE
applab.it.yougotour.permission.C2D_MESSAGE
applicationId.permission.C2D_MESSAGE
applite.otv.permission.C2D_MESSAGE
appmaker.merq.WerbN.permission.C2D_MESSAGE
apps.appzdreamer.voicerecorderpro.permission.C2D_MESSAGE
apps.market.xing.xong.permission.C2D_MESSAGE
apps.market.yung.funk.permission.C2D_MESSAGE
apps.redpi.soundcalibration.permission.C2D_MESSAGE
apps.redpi.touchscreenrepair.permission.C2D_MESSAGE
apps.stevecampos.fire.anonymouschat.permission.C2D_MESSAGE
appsmoment.huutaivn.mykingdom.permission.C2D_MESSAGE
appstoxe.habergalatasaray.permission.C2D_MESSAGE
ar.com.develup.pasapalabra.permission.C2D_MESSAGE
ar.com.kinetia.liga.permission.C2D_MESSAGE
ar.com.na8.fandanz.permission.C2D_MESSAGE
ar.com.soodex.ahorcado.permission.C2D_MESSAGE
ar.com.zgroup.liveradio.permission.C2D_MESSAGE
ar.gob.buenosaires.bawifi.permission.MAPS_RECEIVE
arabic.tv3.permission.C2D_MESSAGE
archos.permission.FULLSCREEN
archos.permission.FULLSCREEN.FULL
armando_32.permission.C2D_MESSAGE
artist.makeup.nsol.makeupartist.permission.C2D_MESSAGE
artist.makeup.nsol.makeupartist.permission.MAPS_RECEIVE
arz.islamiceventmanager.permission.C2D_MESSAGE
ash.com.highwaydelite_merchant.permission.C2D_MESSAGE
asia.mseed.fashioncity5925.permission.C2D_MESSAGE
asia.mseed.jumpingflower.permission.C2D_MESSAGE
asian.dating1.permission.C2D_MESSAGE
asian.dating4u.permission.C2D_MESSAGE
asianetmobiletvplus.asianetmobiletv.com.permission.C2D_MESSAGE
assist.geoguardian2.android.permission.C2D_MESSAGE
assist.geoguardian2.android.permission.MAPS_RECEIVE
assist.geoteam.android.permission.C2D_MESSAGE
assist.geoteam.android.permission.MAPS_RECEIVE
assist.taxiguardian.android.permission.C2D_MESSAGE
assist.taxiguardian.android.permission.MAPS_RECEIVE
assist.taxiguardianpro.android.permission.C2D_MESSAGE
assist.taxiguardianpro.android.permission.MAPS_RECEIVE
assistantvisites.maif.fr.fremium.permission.C2D_MESSAGE
asus.permission.CALL_DEMOAPP
asus.permission.DELETE_PACKAGE
asus.permission.FORCE_STOP_PACKAGE
asus.permission.GET_ACCOUNT
asus.permission.GET_APP_OPS_STATS
asus.permission.GRANT_RUNTIME_PERMISSIONS
asus.permission.INTERACT_ACROSS_USERS
asus.permission.MANAGE_APPS
asus.permission.MANAGE_SETTINGS
asus.permission.NETWORK_MANAGEMENT
asus.permission.NOTIFICATION_MANAGEMENT
asus.permission.REVOKE_RUNTIME_PERMISSIONS
asus.permission.SOC_PROVIDER
asus.permission.UPDATE_APP_OPS_STATS
asus.permission.WRITE_CONTACTS
at.a1telekom.android.a1tv.permission.C2D_MESSAGE
at.bluesource.mobilepocket.permission.C2D_MESSAGE
at.bs.euro2016.permission.C2D_MESSAGE
at.com.media.markt.permission.C2D_MESSAGE
at.com.media.markt.permission.RECEIVE_ADM_MESSAGE
at.com.media.markt.permission.UA_DATA
at.com.media.saturn.permission.C2D_MESSAGE
at.com.media.saturn.permission.RECEIVE_ADM_MESSAGE
at.com.media.saturn.permission.UA_DATA
at.innsbruck.tourism.permission.C2D_MESSAGE
at.laendleanzeiger.kleinanzeigen.permission.C2D_MESSAGE
at.laendleanzeiger.kleinanzeigen.permission.MAPS_RECEIVE
at.mobilkom.android.libhandyparken.permission.MAPS_RECEIVE
at.momox.permission.A4S_SEND
at.momox.permission.C2D_MESSAGE
at.nk.tools.iTranslate.permission.C2D_MESSAGE
at.novarock.app.permission.C2D_MESSAGE
at.novarock.app.permission.MAPS_RECEIVE
at.post.privat.permission.C2D_MESSAGE
at.steirersoft.mydarttraining.permission.C2D_MESSAGE
at.trafficpass.android.arboe.parkme.maps.permission.MAPS_RECEIVE
at.trafficpass.android.parkme.maps.permission.MAPS_RECEIVE
at.trafficpass.android.parkme.permission.C2D_MESSAGE
at.trafficpass.parkmequick.parkmequick.maps.permission.MAPS_RECEIVE
at.vienna.android.permission.C2D_MESSAGE
at.vol.android.permission.C2D_MESSAGE
at.vol.android.permission.RECEIVE_ADM_MESSAGE
at.volume.frequency.permission.C2D_MESSAGE
at.wiesenfestivals.app.permission.C2D_MESSAGE
at.wiesenfestivals.app.permission.MAPS_RECEIVE
ata.squid.kaw.permission.C2D_MESSAGE
atlantis.bubble.permission.C2D_MESSAGE
atomsage.com.eventapp.permission.MAPS_RECEIVE
au.com.alexooi.android.flashcards.alphabets.permission.C2D_MESSAGE
au.com.auspost.android.permission.C2D_MESSAGE
au.com.aussiecommerce.livingsocial.permission.C2D_MESSAGE
au.com.cricket.permission.C2D_MESSAGE
au.com.cricket.permission.RECEIVE_ADM_MESSAGE
au.com.cricket.permission.UA_DATA
au.com.daguannohairdesign2.cafpg.permission.C2D_MESSAGE
au.com.fuelmap.permission.MAPS_RECEIVE
au.com.homeloveapp.permission.C2D_MESSAGE
au.com.optus.express.moc.permission.C2D_MESSAGE
au.com.optus.express.myoptus.tablet.permission.MAPS_RECEIVE
au.com.optus.selfservice.permission.C2D_MESSAGE
au.com.optus.sport.permission.C2D_MESSAGE
au.com.penguinapps.android.babyfeeding.client.android.permission.C2D_MESSAGE
au.com.penguinapps.android.drawing.permission.C2D_MESSAGE
au.com.penguinapps.android.match.permission.C2D_MESSAGE
au.com.penguinapps.android.readsentences.permission.C2D_MESSAGE
au.com.tennis.aoplayer.permission.C2D_MESSAGE
au.com.tinmangames.choices.permission.C2D_MESSAGE
au.com.vodafone.mobile.gss.permission.C2D_MESSAGE
au.com.vodafone.mobile.gss.permission.RECEIVE_ADM_MESSAGE
au.com.vodafone.mobile.gss.permission.UA_DATA
audiobible.verses.bible.dailybible.bibleverses.audio.permission.C2D_MESSAGE
aul.irm.ahoraCaigo.permission.C2D_MESSAGE
aul.irm.ahoraCaigo.permission.RECEIVE_ADM_MESSAGE
aul.irm.lingo.permission.C2D_MESSAGE
aul.irm.lingo.permission.RECEIVE_ADM_MESSAGE
aul.irm.pasaPalabra.permission.C2D_MESSAGE
aul.irm.pasaPalabra.permission.RECEIVE_ADM_MESSAGE
aul.irm.ruleta.permission.C2D_MESSAGE
aul.irm.ruleta.permission.RECEIVE_ADM_MESSAGE
aurangabad.ganesh.aindicator.permission.C2D_MESSAGE
aussie.rules.live.permission.C2D_MESSAGE
az.appsolution.appAliyevDent.permission.C2D_MESSAGE
az.appsolution.appBakuBeauty.permission.C2D_MESSAGE
az.appsolution.appHekimTap.permission.C2D_MESSAGE
az.appsolution.appILS.permission.C2D_MESSAGE
az.appsolution.appMassageByTurkan.permission.C2D_MESSAGE
az.appsolution.appTapAl.permission.C2D_MESSAGE
az.appsolution.appUstaTap.permission.C2D_MESSAGE
az.azpark.azpark.permission.C2D_MESSAGE
az.sovde.permission.C2D_MESSAGE
az.start.android.oxu.permission.C2D_MESSAGE
b52.qka.mobi.permission.C2D_MESSAGE
ba.fix.android.permission.C2D_MESSAGE
ba.lum.deserttycoon.permission.C2D_MESSAGE
ba.pik.v2.android.permission.C2D_MESSAGE
bac.casanet.menara.permission.C2D_MESSAGE
bage.binoculars.permission.C2D_MESSAGE
bage.image2pdf.permission.C2D_MESSAGE
bage.photomagic.blur.permission.C2D_MESSAGE
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.Hyatt.hyt
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.baidu.push.example
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.coupler.online.International
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.eyougame.dgzz
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.hcg.cok.gp
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.htc.launcher
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.qiyi.video
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.sinphyutaw.mshop
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.xingjoys.cot.gp
baidu.push.permission.WRITE_PUSHINFOPROVIDER.com.yueaii.online
baidu.push.permission.WRITE_PUSHINFOPROVIDER.mobisocial.arcade
baits.gameengine.com.baitsio.permission.C2D_MESSAGE
baivipnet.gamedanhbai.online.permission.C2D_MESSAGE
banca.doithuong.permission.C2D_MESSAGE
bankers.addahindi.permission.C2D_MESSAGE
barbershop_37.permission.C2D_MESSAGE
basic.guru.hindi.wiki.permission.C2D_MESSAGE
bbc.mobile.news.uk.permission.C2D_MESSAGE
bbc.mobile.news.ww.permission.C2D_MESSAGE
bc.leg.permission.C2D_MESSAGE
bd.iqtest.permission.C2D_MESSAGE
bd.koubilgmuh.permission.C2D_MESSAGE
bd.koubilgmuh.permission.MAPS_RECEIVE
bd.kouobs.permission.C2D_MESSAGE
bd.kouyemekhane.permission.C2D_MESSAGE
be.appstrakt.ilovetechno.permission.C2D_MESSAGE
be.basecompany.basecloud.permission.C2D_MESSAGE
be.cad.made.in.belgium.permission.C2D_MESSAGE
be.cad.red.price.permission.C2D_MESSAGE
be.com.media.markt.permission.C2D_MESSAGE
be.com.media.markt.permission.RECEIVE_ADM_MESSAGE
be.com.media.markt.permission.UA_DATA
be.tweedehands.m.permission.C2D_MESSAGE
be.vrt.ketnet.ketnet.permission.C2D_MESSAGE
be.vrt.onderzoekeninnovatie.thewall.permission.C2D_MESSAGE
be.webelite.intervaltrainer.permission.C2D_MESSAGE
beauty.tip.permission.C2D_MESSAGE
beemoov.mabimbo.android.permission.C2D_MESSAGE
berkinalex.kalilinuxmanuales.permission.C2D_MESSAGE
bestchat.dating.apps.chatter.permission.C2D_MESSAGE
bestdatingsites.loveeapp.permission.C2D_MESSAGE
bet.tahminimce.net.fixedmatchestips.permission.C2D_MESSAGE
bet.tahminimce.net.fixedmatchestips.permission.RECEIVE_ADM_MESSAGE
bff.best.friends.forever.video.chat.gcm.permission.C2D_MESSAGE
bff.best.friends.forever.video.chat.permission.C2D_MESSAGE
bg.abv.andro.emailapp.permission.C2D_MESSAGE
bg.emag.android.permission.C2D_MESSAGE
bg.gong.permission.C2D_MESSAGE
bg.hbo.hbogo.permission.C2D_MESSAGE
bg.mytv.android.permission.C2D_MESSAGE
bg.vesti.permission.C2D_MESSAGE
bhandar.app.by.beautyhindi.permission.C2D_MESSAGE
bhandar.app.by.beautytips.permission.C2D_MESSAGE
bhmedia.moonphasecalendar.permission.C2D_MESSAGE
bible.kingjamesbiblelite.permission.C2D_MESSAGE
biblereader.olivetree.permission.C2D_MESSAGE
bibleverses.bibleverse.bible.biblia.verse.devotion.permission.C2D_MESSAGE
biblia.de.estudo.permission.C2D_MESSAGE
biblia.devocional.permission.C2D_MESSAGE
binaryearth.digitalwatchface.permission.C2D_MESSAGE
binaryearth.handygpsfree.permission.C2D_MESSAGE
binaryearth.handyunits.permission.C2D_MESSAGE
binumobile.binuapp.permission.C2D_MESSAGE
biz.app4mobile.app_00831addfbae4cddb48b95014c53e040.app.permission.C2D_MESSAGE
biz.app4mobile.app_00831addfbae4cddb48b95014c53e040.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_1b842ae76018473d8cf9909bd529c4b3.app.permission.C2D_MESSAGE
biz.app4mobile.app_1b842ae76018473d8cf9909bd529c4b3.app.permission.MAPS_RECEIVE
biz.app4mobile.app_1b842ae76018473d8cf9909bd529c4b3.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_2113f21e6a804763929059393fd8f11a.app.permission.C2D_MESSAGE
biz.app4mobile.app_2113f21e6a804763929059393fd8f11a.app.permission.MAPS_RECEIVE
biz.app4mobile.app_2113f21e6a804763929059393fd8f11a.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_2c11a8d3dff74da0823a1a5f330ffc03.app.permission.C2D_MESSAGE
biz.app4mobile.app_2c11a8d3dff74da0823a1a5f330ffc03.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_42e01cb53b7d411eaba8014233fde94d.app.permission.C2D_MESSAGE
biz.app4mobile.app_42e01cb53b7d411eaba8014233fde94d.app.permission.MAPS_RECEIVE
biz.app4mobile.app_42e01cb53b7d411eaba8014233fde94d.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_6960ed1795244b00b8b967a4f3c4c596.app.permission.C2D_MESSAGE
biz.app4mobile.app_6960ed1795244b00b8b967a4f3c4c596.app.permission.MAPS_RECEIVE
biz.app4mobile.app_6960ed1795244b00b8b967a4f3c4c596.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_6e57bd0bb5704069a3dedfdfa60f2c82.app.permission.C2D_MESSAGE
biz.app4mobile.app_6e57bd0bb5704069a3dedfdfa60f2c82.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_83c2a91848fd4b0dbbe5fed46e7bc171.app.permission.C2D_MESSAGE
biz.app4mobile.app_83c2a91848fd4b0dbbe5fed46e7bc171.app.permission.MAPS_RECEIVE
biz.app4mobile.app_83c2a91848fd4b0dbbe5fed46e7bc171.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_a0304d426a134af39152eed221607cfd.app.permission.C2D_MESSAGE
biz.app4mobile.app_a0304d426a134af39152eed221607cfd.app.permission.MAPS_RECEIVE
biz.app4mobile.app_a0304d426a134af39152eed221607cfd.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_a5e90fa8aaae455d84a031b66db8d140.app.permission.C2D_MESSAGE
biz.app4mobile.app_a5e90fa8aaae455d84a031b66db8d140.app.permission.MAPS_RECEIVE
biz.app4mobile.app_a5e90fa8aaae455d84a031b66db8d140.app.permission.RECEIVE_ADM_MESSAGE
biz.app4mobile.app_ef0690a5f0c8477fb9879dc06b906638.app.permission.C2D_MESSAGE
biz.app4mobile.app_ef0690a5f0c8477fb9879dc06b906638.app.permission.MAPS_RECEIVE
